app/controllers/calorie_intakes_controller.rb

SELECT * FROM `calorie_intakes` WHERE (user_id=1 and date between '2011-02-13' and '2011-03-16') ORDER BY date
SELECT * FROM `users`
---
  def index
    puts session[:username]
    Time.zone="Bucharest"
    start_date=Time.zone.now
    start_date=start_date-ONE_MONTH/2
    end_date =Time.zone.now+ 60*1000
    end_date= end_date
    @calorie_intakes = CalorieIntake.find_for_user_for_interval session[:user_id],start_date,end_date

SELECT * FROM `calorie_intakes` WHERE (`calorie_intakes`.`id` = 980190962)
---
  def show
    @calorie_intake = CalorieIntake.find(params[:id])

SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
---
  def new
    @calorie_intake = CalorieIntake.new
    @user = User.find session[:user_id] unless session[:user_id]==nil

SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
SELECT * FROM `calorie_intakes` WHERE (`calorie_intakes`.`id` = 980190962)
---
  def edit
    @user = User.find session[:user_id] unless session[:user_id]==nil
    @calorie_intake = CalorieIntake.find(params[:id])

SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
INSERT INTO `calorie_intakes` (`date`, `user_id`, `description`, `ci_type`, `calorie_intake`) VALUES(NULL, NULL, NULL, NULL, 2090.0)
---
  def create
    @calorie_intake = CalorieIntake.new(params[:calorie_intake])
    @user = User.find session[:user_id] unless session[:user_id]==nil
    @calorie_intake.user=@user
    respond_to do |format|
      if @calorie_intake.save

SELECT * FROM `calorie_intakes` WHERE (`calorie_intakes`.`id` = 980190962)
UPDATE `calorie_intakes` SET `calorie_intake` = 100.0 WHERE `id` = 980190962
---
  def update
    @calorie_intake = CalorieIntake.find(params[:id])

    respond_to do |format|
      if @calorie_intake.update_attributes(params[:calorie_intake])

SELECT * FROM `calorie_intakes` WHERE (`calorie_intakes`.`id` = 980190962)
DELETE FROM `calorie_intakes` WHERE `id` = 980190962
---
  def destroy
    @calorie_intake = CalorieIntake.find(params[:id])
    @calorie_intake.destroy