app/controllers/trainings_controller.rb

SELECT * FROM `trainings` WHERE (user_id=1)
---
  def index
    logger.info 'loading trainings ..'
    @trainings= Training.find_for_user session[:user_id]

SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
INSERT INTO `trainings` (`duration`, `user_id`, `training_date`, `description`, `training_type`, `calories`) VALUES(20, NULL, NULL, NULL, 'cardio', 100)
---
  def create
    @training = Training.new(params[:training])
    @user= User.find session[:user_id] unless session[:user_id]==nil
    @training.user=@user
    @training.user_id=session[:user_id]
    respond_to do |format|
      #load the current user


      if @training.save

SELECT * FROM `users`
---
  def new
    @users= User.all

SELECT * FROM `trainings` WHERE (`trainings`.`id` = 1)
DELETE FROM `trainings` WHERE `id` = 1
---
  def destroy
    @training = Training.find(params[:id])
    @training.destroy

SELECT * FROM `trainings` WHERE (`trainings`.`id` = 1)
---
  def show
    @training = Training.find(params[:id])

SELECT * FROM `trainings` WHERE (`trainings`.`id` = 1)
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
---
  def edit
    @training = Training.find(params[:id])
    @user= User.find @training.user_id

SELECT * FROM `trainings` WHERE (`trainings`.`id` = 1)
UPDATE `trainings` SET `duration` = 20, `calories` = 100 WHERE `id` = 1
---
  def update
    @training = Training.find(params[:id])

    respond_to do |format|
      if @training.update_attributes(params[:training])