app/controllers/users_controller.rb

INSERT INTO `users` (`salt`, `created_at`, `updated_at`, `username`, `role`, `password`) VALUES(NULL, '2011-03-05 21:06:13', '2011-03-05 21:06:13', 'mihai', NULL, 'test')
---
  def create
    @user = User.new(params[:user])
    respond_to do |format|
      if @user.save

SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
---
  def update
    @user = User.find(params[:id])

SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
DELETE FROM `users` WHERE `id` = 1
---
  def destroy
    @user = User.find(params[:id])
    @user.destroy