app/controllers/weights_controller.rb

  def index
    @role=session[:user_role]
    if @role=='admin'
      @weights = Weight.all
      @weights_pag=@weights.paginate(:page => params[:page],:per_page   => @@per_page)
---
SELECT `weights`.* FROM `weights` WHERE (user_id=980190964 and weighting_date between '2010-06-10' and '2011-06-17') ORDER BY weighting_date desc
SELECT COUNT(*) AS count_id FROM `weights`
SELECT `weights`.* FROM `weights` LIMIT 0, 10

  def show
    @weight = Weight.find(params[:id])
---
SELECT `weights`.* FROM `weights` WHERE (`weights`.`id` = 980191081) LIMIT 1

  def edit
    @weight = Weight.find(params[:id])
    @user = User.find session[:user_id]
---
SELECT `weights`.* FROM `weights` WHERE (`weights`.`id` = 980190977) LIMIT 1
SELECT `users`.* FROM `users` WHERE (`users`.`id` = 980190964) LIMIT 1

  def create
    @weight = Weight.new(params[:weight])
    @user = User.find session[:user_id]
    @weight.user=@user

    respond_to do |format|
      if @weight.save
---
SELECT `users`.* FROM `users` WHERE (`users`.`id` = 980190964) LIMIT 1
INSERT INTO `weights` (`user_id`, `weight`, `weighting_date`) VALUES (980190964, 111.3, '2011-06-17 00:00:00')

  def update
    @weight = Weight.find(params[:id])
---
SELECT * FROM `weights` WHERE (`weights`.`id` = 200)

  def destroy
    @weight = Weight.find(params[:id])
    @weight.destroy
---
SELECT * FROM `weights` WHERE (`weights`.`id` = 200)
DELETE FROM `weights` WHERE `id` = 200